# Homebrew formulae
brew "chezmoi"
brew "zsh"
brew "fzf"
brew "jenv"
brew "openjdk@21"
brew "maven"
brew "k9s"
brew "python@3.13"
brew "python@3.12"
brew "pyenv"
brew "pipx"

# Casks
cask "firefox"
cask "gcloud-cli"
cask "intellij-idea"
cask "iterm2"
cask "postman"
cask "visual-studio-code"

# Python & Django Development
vscode "batisteo.vscode-django" #Adds syntax highlighting, snippets, and support for Django projects.
vscode "donjayamanne.python-environment-manager" #UI to create, view, and switch between Python environments and interpreters.
vscode "donjayamanne.python-extension-pack" #A bundle of top Python tools for a smoother development workflow.
vscode "ms-python.debugpy" #Provides advanced debugging features for Python.
vscode "ms-python.python" #Core Python language support—IntelliSense, linting, debugging, and more.
vscode "ms-python.vscode-pylance" #Fast, smart IntelliSense and type-checking engine for Python.
vscode "ms-python.vscode-python-envs" #Manages and auto-detects Python virtual environments and interpreters.
vscode "kevinrose.vsc-python-indent" #Fixes Python indentation issues for consistent code style.
vscode "njpwerner.autodocstring" #Generates Python docstrings with one click for better code documentation.

# Template & Data Formats
vscode "wholroyd.jinja" #Syntax highlighting and snippets for Jinja/Jinja2 templates.
vscode "mechatroner.rainbow-csv" # Colorizes columns and provides tools for working with CSV/TSV files.

# Java & Java Build Tools
vscode "redhat.java" #Core Java language support—code completion, refactoring, and project management.
vscode "vscjava.vscode-java-pack" #Official pack bundling major Java extensions for a full-featured development environment.
vscode "vscjava.vscode-java-debug" #Java debugger for running and troubleshooting Java code.
vscode "vscjava.vscode-java-dependency" #Visualizes project dependencies for easy Java project navigation.
vscode "vscjava.vscode-java-test" #Enables Java unit test running and debugging with rich feedback.
vscode "vscjava.vscode-maven" #Integrates Apache Maven for Java build management and execution.
vscode "vscjava.vscode-gradle" #Brings Gradle build and task support to Java projects in VS Code.

# Source Control & Code Quality
vscode "eamodio.gitlens" #Powerful Git history and code annotation tools directly in your editor.
vscode "sonarsource.sonarlint-vscode" #On-the-fly code quality analysis to find bugs, smells, and security issues.

# Productivity & Formatting Tools
vscode "esbenp.prettier-vscode" # Universal code formatter for consistent code style across many languages.
vscode "visualstudioexptteam.vscodeintellicode" #AI-assisted code completion based on patterns from popular open-source projects.
vscode "visualstudioexptteam.intellicode-api-usage-examples" #Gives real-world API usage examples for faster learning and fewer mistakes.
