# ── Shell & terminal ─────────────────────────────────────────────────────────
brew "zsh"
brew "fzf"
brew "starship"
brew "zoxide"
brew "atuin"
brew "direnv"

# ── File & search tools ───────────────────────────────────────────────────────
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"

# ── Git & code review ─────────────────────────────────────────────────────────
brew "git-delta"
brew "lazygit"
brew "gh"

# ── Editor & multiplexer ──────────────────────────────────────────────────────
brew "neovim"
brew "tmux"

# ── Task runner & toolchain management ───────────────────────────────────────
brew "just"
brew "mise"
brew "uv"

# ── Data & infra tools ───────────────────────────────────────────────────────
brew "tree-sitter-cli"
brew "jq"
brew "yq"
brew "btop"
brew "tldr"
brew "dust"
brew "k9s"
brew "chezmoi"

# ── Java & build tools (managed by mise) ─────────────────────────────────────
brew "maven"

# ── Python ────────────────────────────────────────────────────────────────────
brew "python@3.13"

# ── Casks ─────────────────────────────────────────────────────────────────────
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "intellij-idea"
cask "iterm2"
cask "postman"
cask "visual-studio-code"

# ── VS Code extensions ────────────────────────────────────────────────────────
# Python & Django Development
vscode "batisteo.vscode-django"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "kevinrose.vsc-python-indent"
vscode "njpwerner.autodocstring"

# Template & Data Formats
vscode "wholroyd.jinja"
vscode "mechatroner.rainbow-csv"

# Java & Java Build Tools
vscode "redhat.java"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-gradle"

# Source Control & Code Quality
vscode "eamodio.gitlens"
vscode "sonarsource.sonarlint-vscode"

# Productivity & Formatting Tools
vscode "esbenp.prettier-vscode"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
